full_run.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="80" type="tcp"/>
  </servers>
  <load>
    <!-- Scenario 1: Single User -->
    <arrivalphase phase="1" duration="6" unit="second">
      <users maxnumber="1" arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>
  <!-- Define User Agents -->
  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="full_run-20140417-110031" probability="100" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="username"/>
      </setdynvars>
      <!-- Hit Landing Page -->
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com" version="1.1" method="GET"/>
      </request>
      <!-- Hit Register Page and store Activation URL from response -->
      <thinktime random="true" value="2"/>
      <request subst="true">
        <dyn_variable name="activationurl" re="id='activation_link' href='(.*)'"/>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/user/register" version="1.1" contents="email=%%_username%%%40test.com&amp;email_confirm=%%_username%%%40test.com&amp;password=Passw00rd&amp;password_confirm=Passw00rd&amp;confirmUnderstanding=1&amp;submit=I+understand" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
      <!-- Activate Account -->
      <request subst="true">
        <http url="%%_activationurl%%" version="1.1" method="GET"/>
      </request>
      <!-- Login -->
      <request subst="true">
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/user/login" version="1.1" contents="email=%%_username%%%40test.com&amp;password=Passw00rd&amp;submit=Sign+in" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
      <!-- Login -->
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/user/about-you" version="1.1" contents="title=Mr&amp;firstname=Stephen&amp;middlename=Philip&amp;surname=Richards&amp;dob%5Bday%5D=13&amp;dob%5Bmonth%5D=August&amp;dob%5Byear%5D=1963&amp;addr1=50+Tregunter+Road&amp;addr2=West+Brompton&amp;addr3=&amp;town=London&amp;county=&amp;postcode=SW10+9XX&amp;country=UK&amp;save=Save+and+continue" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
      <!-- Select which type of LPA to create -->
      <thinktime random="true" value="5"/>
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/create/lpa-type" version="1.1" contents="lpa_type=Property+and+financial+affairs&amp;save=Save+and+continue" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
      <!-- Push Create Donor Button -->
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/create/donor" version="1.1" method="GET"/>
      </request>
      <!-- Fill Add Donor Form -->
      <thinktime random="true" value="5"/>
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/create/add-donor" version="1.1" contents="title=Mr&amp;firstname=test&amp;middlename=&amp;surname=test&amp;othername=&amp;dob%5Bday%5D=02&amp;dob%5Bmonth%5D=03&amp;dob%5Byear%5D=1920&amp;phone=&amp;email=&amp;address%5Baddr1%5D=aaa&amp;address%5Baddr2%5D=&amp;address%5Baddr3%5D=&amp;address%5Btown%5D=bbb&amp;address%5Bcounty%5D=ccc&amp;address%5Bpostcode%5D=ddd&amp;address%5Bcountry%5D=UK&amp;donor_cannot_sign=0" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>
      <!-- Get PDF of Draft LPA -->
      <thinktime random="true" value="2"/>
      <request>
        <http url="http://ec2-54-229-53-8.eu-west-1.compute.amazonaws.com/pdf/draft/Lasting-Power-of-Attorney-Draft.pdf" version="1.1" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>